----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
       BatchNorm2d-1           [-1, 51, 16, 16]               0
            Conv2d-2           [-1, 64, 16, 16]          29,376
       BatchNorm2d-3           [-1, 64, 16, 16]             128
              ReLU-4           [-1, 64, 16, 16]               0
            Conv2d-5          [-1, 128, 16, 16]          73,728
       BatchNorm2d-6          [-1, 128, 16, 16]             256
              ReLU-7          [-1, 128, 16, 16]               0
            Conv2d-8          [-1, 128, 16, 16]         147,456
       BatchNorm2d-9          [-1, 128, 16, 16]             256
           Conv2d-10          [-1, 128, 16, 16]           8,192
      BatchNorm2d-11          [-1, 128, 16, 16]             256
             ReLU-12          [-1, 128, 16, 16]               0
       BasicBlock-13          [-1, 128, 16, 16]               0
           Conv2d-14          [-1, 128, 16, 16]         147,456
      BatchNorm2d-15          [-1, 128, 16, 16]             256
             ReLU-16          [-1, 128, 16, 16]               0
           Conv2d-17          [-1, 128, 16, 16]         147,456
      BatchNorm2d-18          [-1, 128, 16, 16]             256
             ReLU-19          [-1, 128, 16, 16]               0
       BasicBlock-20          [-1, 128, 16, 16]               0
           Conv2d-21          [-1, 128, 16, 16]         147,456
      BatchNorm2d-22          [-1, 128, 16, 16]             256
             ReLU-23          [-1, 128, 16, 16]               0
           Conv2d-24          [-1, 128, 16, 16]         147,456
      BatchNorm2d-25          [-1, 128, 16, 16]             256
             ReLU-26          [-1, 128, 16, 16]               0
       BasicBlock-27          [-1, 128, 16, 16]               0
           Conv2d-28          [-1, 256, 16, 16]         294,912
      BatchNorm2d-29          [-1, 256, 16, 16]             512
             ReLU-30          [-1, 256, 16, 16]               0
           Conv2d-31          [-1, 256, 16, 16]         589,824
      BatchNorm2d-32          [-1, 256, 16, 16]             512
           Conv2d-33          [-1, 256, 16, 16]          32,768
      BatchNorm2d-34          [-1, 256, 16, 16]             512
             ReLU-35          [-1, 256, 16, 16]               0
       BasicBlock-36          [-1, 256, 16, 16]               0
           Conv2d-37          [-1, 256, 16, 16]         589,824
      BatchNorm2d-38          [-1, 256, 16, 16]             512
             ReLU-39          [-1, 256, 16, 16]               0
           Conv2d-40          [-1, 256, 16, 16]         589,824
      BatchNorm2d-41          [-1, 256, 16, 16]             512
             ReLU-42          [-1, 256, 16, 16]               0
       BasicBlock-43          [-1, 256, 16, 16]               0
           Conv2d-44          [-1, 256, 16, 16]         589,824
      BatchNorm2d-45          [-1, 256, 16, 16]             512
             ReLU-46          [-1, 256, 16, 16]               0
           Conv2d-47          [-1, 256, 16, 16]         589,824
      BatchNorm2d-48          [-1, 256, 16, 16]             512
             ReLU-49          [-1, 256, 16, 16]               0
       BasicBlock-50          [-1, 256, 16, 16]               0
AdaptiveAvgPool2d-51            [-1, 256, 2, 2]               0
           Linear-52                  [-1, 200]         205,000
================================================================
Total params: 4,335,880
Trainable params: 4,335,880
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.05
Forward/backward pass size (MB): 17.73
Params size (MB): 16.54
Estimated Total Size (MB): 34.32
----------------------------------------------------------------

